import React from 'react';
import bitcoinImage from './whatisbitcoin.jpg'
import './Fa.scss'
import {Link} from "react-router-dom";

const Fa = () => {
    return (
        <div className='WhatIsBitCoin'>
            <img src={bitcoinImage}/>
            <h2>بیت کوین چیست؟</h2>
            <p>بیت کوین در چند سال اخیر با نوسانات فراوان قیمت و اوج گرفتن های متوالی، نام خود را در سراسر دنیا بر سر
                زبانها انداخته است و افراد زیادی را به فکر و تحقیق واداشته تا بپرسند بیت کوین چیست؟ هر چند پاسخ کامل به
                این پرسش به سادگی امکان پذیر نیست اما در ابتدای این نوشته یک پاسخ ساده به شما می دهیم: بیت کوین یک نوع
                پول است؛ درست مانند طلا و نقره که سالها توسط انسانها برای تجارت استفاده می شدند که بعدها اسکناس و بعدتر
                حواله ها و تراکنش های بانکی جایگزین آنها شدند. تمام این ابزارها در برهه هایی از تاریخ نقش پول را در
                مبادلات انسانها داشته اند. بیت کوین نیز یک نوع پول و وسیله تجارت بر بستر اینترنت است و در این موضوع
                بیشتر به حواله ها و تراکنش های بانکی شبیه است. اما جهت آشنایی کامل با جزئیات بیت کوین و روش کار با این
                پول خارق العاده، به صورت کامل باید به بخشهای متنوع آن بپردازیم.

            </p>
            <h3>بیت کوین چیست؟</h3>
            <p>بیت کوین(نام لاتین:Bitcoin؛نماد:BTC)، یک پول یا ارز دیجیتالی است که به صورت الکترونیکی توزیع و استفاده می
                شود. شبکه این ارز دیجیتال به صورت غیر متمرکز و کاربر به کاربر است. هیچ شخص یا نهادی این شبکه را کنترل
                نمی کند. ارز دیجیتال بیت کوین نمی تواند خارج از برنامه ریزی انجام شده، چاپ یا خلق شود و تعداد آن محدود
                است. فقط 21 میلیون بیت کوین برای همیشه تولید می شود. تراکنش های شبکه بیت کوین، در یک لاگ عمومی با
                تکنولوژی بلاک چین(blockchain) ذخیره می شوند.

                در اولین مقالاتی که در وب فارسی در مورد بیت کوین نوشته شد، بیت کوین آینده پولهای دیجیتال نامیده شد.
                اکنون به آن آینده در حال نزدیک شدن هستیم ولی باید یک گام فراتر گذاشته و بیت کوین را آینده پول بنامیم. در
                واقع بیت کوین و تکنولوژی پشت این پول و مزایای این تکنولوژی، شرایطی را به وجود آورده تا به این نتیجه
                برسیم که سیستم فعلی مالی و پولی دنیا که سالها بر اساس آن تبادلات مالی انجام شده، یک اشتباه و ناشی از ضعف
                و عدم وجود تکنولوژی های دیجیتال بوده است. پولِ آینده، بیت کوین یا چیزی شبیه به آن خواهد بود.</p>
            <h3>چه کسی بیت کوین را ساخته است؟</h3>
            <p>بیت کوین برای اولین بار در سال 2009 به عنوان یک نرم افزار متن باز توسط یک برنامه نویس ناشناس (یا گروهی از
                برنامه نویسان) تحت نام مستعار ساتوشی ناکاموتو معرفی شد. شایعات زیادی در مورد هویت واقعی ساتوشی ناکاموتو
                مطرح شده است، اما اغلب افراد نام برده شده به عنوان خالق بیت کوین، این ادعا را رد کرده اند.
                ناکاموتو خود را یک مرد 37 ساله که در ژاپن زندگی می کند معرفی کرده است. با این حال از آنجا که تسلط وی به
                انگلیسی بسیار خوب به نظر می رسد و هیچ نشانه ای از نرم افزار وی در ژاپن وجود ندارد، در مورد این ادعا
                تردیدهایی وجود دارد. در اواسط سال 2010 ناکاموتو به سراغ موارد دیگری رفت و بیت کوین را در اختیار چند عضو
                برجسته جامعه بیت کوین قرار داد. ساتوشی نام گاوین اندرسون را به عنوان برنامه نویس و توسعه دهنده اصلی
                اعلام کرده است. تخمین زده می شود که ناکاموتو دارای یک میلیون بیت کوین است، که ارزش آن با قیمت فعلی، در
                حدود 6.5 میلیارد دلار تخمین زده می شود. جهت مشاهده توضیحات کاملتر در مورد خالق بیت کوین می توانید مقاله
                سازنده بیت کوین چه کسی است؟ را مطالعه نمایید. همچنین جهت اطلاعات بیشتر در این زمینه، مطالب مرتبط با
                ساتوشی ناکاموتو را مشاهده نمایید.</p>
            <h3>چه کسی بیت کوین را کنترل می کند؟</h3>
            <p>به گفته ی گاوین آندرسن، اولین چیزی که او پس از ناکاموتو در این پروژه بر آن تمرکز کرد، تمرکز زدایی بیشتر
                شبکه بیت کوین بود. او گفته که به گونه ای عمل کرده که حتی اگر با اتوبوس تصادف کند، این ارز دیجیتال به
                صورت مستقل و خودگردان به وجود خودش ادامه دهد.
                از نظر بسیاری از مردم، مزیت اصلی بیت کوین، استقلال آن از دولت های جهان، بانک ها و شرکت ها است. هیچ مقام
                و یا صاحب قدرتی قادر نیست در تراکنش های بیت کوین دخالتی داشته باشد، بر آنها مالیات بسته و یا پول مردم را
                به زور چپاول کند. علاوه بر این، فعالیت های بیت کوین کاملا شفاف است. هر تراکنشی که صورت می گیرد در یک
                دفتر حساب گسترده عمومی به نام بلاک چین ذخیره می شود.
                اساسا، با این که بیت کوین به عنوان یک شبکه تحت کنترل نیست، این امکان را برای کاربرانش فراهم می سازد تا
                کنترل کاملی بر تمام امورات مالی خود داشته باشند.</p>
            <h3>بیت کوین چطور کار می کند؟ بلاک چین چیست؟</h3>
            <p>یک کاربر در کیف پول خود فقط مقدار بیت کوین و مراحل و نتیجه تراکنش ها را می تواند مشاهده کند. در پشت
                فرایندهای شبکه بیت کوین، یک دفتر حساب عمومی به نام بلاک چین قرار دارد. این دفتر حساب شامل تمام تراکنش
                هایی است که تا به حال پردازش شده است. سوابق دیجیتال تراکنش ها در به اصطلاح بلاک ها قرار دارند. تراکنش ها
                توسط کاربران یا کیف پول آنها رمزگذاری شده و به شبکه ارسال می شوند. به این دلیل بیت کوین، ارز رمزپایه یا
                ارز رمزنگاری شده یا رمز ارز(cryptocurrency) نامیده می شود. این تراکنش های رمزگذاری شده سپس در بلاکها
                گنجانده می شوند.
                اگر شخصی سعی کند فقط یک حرف یا عدد را در یک بلاک تراکنش تغییر دهد، این کار بر تمام بلاک ها تاثیر گذار
                خواهد بود. از آنجا که این یک دفتر حساب عمومی است، تلاش های اشتباه یا تقلب می تواند به راحتی توسط هر کسی
                قابل تشخیص و اصلاح باشد. هر کاربر در کیف پول خود می تواند اعتبار و صحت هر مبادله را بررسی کند. صحت هر
                تراکنش توسط امضای دیجیتال مربوط به آدرس های ارسالی محافظت می شود.
                به دلیل وجود فرایند تایید، ممکن است تکمیل یک تراکنش در شبکه بیت کوین، چند دقیقه زمان ببرد. پروتکل بیت
                کوین به گونه ای طراحی شده است که استخراج هر بلوک در حدود 10 دقیقه زمان می برد. جهت آشنایی کامل با بلاک
                چین و مفاهیم آن، مطالب زیر می تواند به شما کمک کند:</p>
            <h3>ویژگی های بیت کوین</h3>
            <h4>غیرمتمرکز بودن</h4>
            <p>یکی از اهداف اصلی ساتوشی ناکاموتو هنگام خلق بیت کوین، استقلال شبکه آن از هر گونه قدرت کنترل گر بود. این
                ارز دیجیتال رمزپایه به گونه ای طراحی شده است که هر شخص و هر کسب کار و همچنین هر دستگاه دخیل در استخراج و
                تایید اعتبار تراکنش ها، بخشی از یک شبکه وسیع را تشکیل می دهند. همچنین طراحی طوری است که حتی اگر بخشی از
                شبکه از دسترس خارج شود، پول همچنان در حرکت خواهد بود.</p>
            <h4>ناشناس بودن</h4>
            <p>این روزها بانک ها تقریبا همه چیز را درباره ی مشتریان خود شامل تاریخچه اعتبار، آدرس ها، شماره تلفن ها،
                روند دخل و خرج و نیز غیره را می دانند. با توجه به این که نیازی نیست کیف پول به هیچ گونه اطلاعات شناسایی
                شخصی مرتبط شود، این داستان در بیت کوین بسیار متفاوت است. در حالی که برخی از مردم نمی خواهند اموال آن ها
                به وسیله ی هیچ یک از مقامات کنترل و ردیابی شود، گروهی دیگر ممکن است استدلال کنند تجارت مواد مخدر،
                تروریسم، و سایر فعالیت های غیر قانونی و خطرناک با توجه به ویژگی ناشناس بودن بیت کوین، رشد و رونق پیدا می
                کند.</p>
            <h4>شفاف بودن</h4>
            <p>ناشناس بودن هویت دارندگان بیت کوین نسبی است، زیرا تراکنش های این ارز رمزپایه تنها زمانی انجام می گیرند که
                در پلت فرم بلاک چین ذخیره شده باشند. در تئوری، اگر آدرس کیف پول شما به طور عمومی مورد استفاده قرار گیرد،
                هر شخصی به وسیله ی مطالعه دفتر حساب بلاک چین، قادر است بگوید چه مقدار پول در آن قرار دارد. هر چند،
                ردیابی از آدرس بیت کوین به اشخاص هنوز هم تقریبا غیر ممکن است.
                کسانی که تمایل دارند تراکنش هایشان ناشناس بماند، می توانند اقدامات لازم را برای گریز از رادار انجام
                دهند. کیف پول های متعددی وجود دارند که ابهام در تراکنش ها و امنیت شما را در اولویت قرار می دهند، اما
                ساده ترین کار، استفاده از چندین آدرس و عدم انتقال مقادیر عظیم پول تنها به یک آدرس بیت کوین می باشد.</p>
            <h4>سریع</h4>
            <p>شبکه بیت کوین پرداخت ها و انتقالات را تقریبا بلافاصله انجام می دهد و به طور معمول فقط چند دقیقه طول می
                کشد که در آن سوی دنیا شخص دیگری ارز را دریافت کند، در حالی که انجام چنین انتقالی در بانک ها می تواند
                چندین روز طول بکشد.</p>
            <h4>غیر قابل لغو</h4>
            <p>زمانی که بیت کوین را برای کسی انتقال می دهید، هیچ راهی برای لغو یا بازگرداندن آن وجود ندارد، مگر این که
                شخص دریافت کنند بخواهد بیت کوین را به شما بازگرداند. این یک تضمین برای دریافت و انتقال پرداخت است، به
                این معنی که شخصی که شما ارز را برای وی انتقال داده اید هرگز نمی تواند ادعا کند که انتقال برای وی انجام
                نشده است.</p>
            <h3>با بیت کوین چه چیزی می توان خرید؟</h3>
            <p>در سال 2009، هنگامی که بیت کوین برای اولین بار معرفی شد، مشخص نبود که چطور و کجا می توان از آن برای
                پرداخت ها استفاده کرد. در حال حاضر می توان عملا توسط این ارز همه چیز خرید. به عنوان مثال شرکت های بزرگی
                مانند مایکروسافت و دل، این ارز رمزپایه را جهت پرداخت برای خریداری بسیاری از محصولات و محتوای دیجیتال خود
                پذیرفته اند. می توانید بلیط هواپیما از هواپیمایی هایی مانند بالتیک ایر خریداری کنید و یا بلیط تئاتر خود
                را با بیت کوین بخرید. موارد دیگری مانند پرداخت هزینه هتل، خرید ملک، پرداخت صورت حساب رستوران و یا تهیه
                کارت هدیه نیز وجود دارند که می توان برای پرداخت و تهیه آن ها از بیت کوین استفاده کرد. در بازارهای بین
                المللی نیز جهت پرداخت ها می توان از این ارز رمزپایه استفاده کرد.
                به هر حال، بیت کوین هنوز هم یک شکل جدید و کاملا پیچیده پرداخت است و بنابراین طبیعی است که مواردی که
                بتوان پرداخت ها را با این ارز انجام داد، محدود باشد. اما هر روز بازارها و مشاغل بیشتر و بیشتری انجام
                پرداخت های خود با این ارز را می پذیرند، از مشاغل و کافی شاپ های کوچک گرفته تا غول های صنایع مختلف.
                علاوه بر این با توجه به دائمی بودن تغییر نرخ مبادلات بیت کوین، این ارز رمزپایه می تواند فرصت مناسبی برای
                سرمایه گذاری باشد. علی غم این که این ارز هنوز یک ارز ناپایدار و تا حدی ناشناخته است، اما در طول 2 سال
                اخیر، ارزش آن بیش از ده برابر شده و قیمت بیت کوین در زمان نگارش این مطلب 6500 دلار است.</p>
            <h3>چطور می توان بیت کوین تهیه کرد؟ خرید بیت کوین</h3>
            <p>ساده ترین روش برای داشتن بیت کوین خرید آن است. این ارز رمزپایه را می توان از طریق انواع صرافی های موجود و
                در دسترس خریداری کرد و یا به طور مستقیم از طریق سایر اشخاص آن را خرید. جهت پرداخت می توان از پول نقد یا
                کارت های اعتباری استفاده کرد و یا حتی از طریق سایر ارزهای رمزنگاری و تبادل با بیت کوین، آن را تهیه کرد.
                اما برای اولین انتقال و دریافت بیت کوین شما به یک کیف پول نیاز خواهید داشت.
                برای تهیه کیف پول گزینه های مختلفی وجود دارند، اما از مهم ترین آنها می توان به کیف پول های آنلاین و کیف
                پول های نرم افزاری که بر روی هارد رایانه شما ذخیره می شوند اشاره کرد. هیچ کیف پولی به طور کامل امن نیست،
                زیرا هارد رایانه شما می تواند خراب شود و یا کیف پول آنلاین ممکن است مورد حمله هکرها قرار گیرد. کیف پول
                های موبایل نیز وجود دارند که دارای ظرفیت ذخیره سازی بالایی هستند و هر لحظه همراه شما هستند. کیف پول های
                سخت افزاری و کیف پول کاغذی با دو کد QR نوع دیگر کیف پول ها هستند که نسبت به حملات سایبری و یا خرابی سخت
                افزاری ایمن می باشند. یکی از سایتهای ارائه دهنده کیف پول آنلاین، بلاک چین دات کام است که جزو اولین
                وبسایتها در این زمینه نیز می باشد. در آموزش زیر می توانید روش استفاده از این کیف پول آنلاین را مشاهده
                نمایید:</p>
            <h2>استخراج بیت کوین</h2>
            <p>راه دیگر بدست آوردن بیت کوین، استخراج آن است. فقط چند سال پیش هر کسی با داشتن یک رایانه قدرتمند می توانست
                بیت کوین استخراج کند، اما در حال حاضر دیگر این گونه نیست. محبوبیت در حال افزایش این ارز و نرخ تبادل آن
                باعث شد تا کمپانی های بزرگ وارد گود شوند و با دستگاه های قدرتمند و تا دندان مسلح اقدام به استخراج بیت
                کوین کنند. این موضوع باعث مشکل شدن استخراج شده و هزینه های انرژی و هزینه استخراج مقرون به صرفه آن را
                افزایش داده است. علاوه بر این میزان بیت کوین های قابل استخراج به طور مداوم در حال کاهش است. هرچند
                سودآوری استخراج بیت کوین به صورت رویایی اولیه نیست ولی هنوز هم یک شیوه مناسب برای کسب درامد می تواند
                باشد. جهت کسب اطلاعات کامل در خصوص استخراج بیت کوین در مقاله زیر به صورت مفصل به این موضوع پرداخته شده
                است:</p>
            <Link to='/fa/start'>اموزش</Link>

        </div>
    );
};

export default Fa;